import { ICardStack } from "../../types/card-type";

export default {
    id: "phl_basic",
    label: "哲学马原基础",

    cards: [
        // [
        //     ``,
        //     ``,
        // ],

        [
            `唯心主义分为*(主观)和*(客观)唯心主义 \\\\
                1. 主观唯心: *(人的感觉)、以*(我)为出发点 \\
                2. 客观唯心: *(道、宇宙精神)、*(非我)、超自然的某种力量 \\
                `,
            `唯心主义的分类和特点?`,
        ],

        [
            `什么是*(一元论)?`,
            `一元论: 世界的本原只有一个`,
        ],
        [
            `辩证唯物主义*(最基本、最核心)的观点是: \\\\
                *(世界的物质统一性原理)
                `,
            `辩证唯物主义*(最基本、最核心)的观点是?`,
        ],

        [
            `哲学重要问题 \\ (世界怎样存在?)`,
            `
                1. *(辩证法): 世界是联系、发展的 \\
                发展的原因在于*(事物的内部矛盾) \\\\

                2. *(形而上学): 世界是孤立静止的 \\
                否认内部矛盾的存在和作用 \\\\
            `,
        ],
        [
            `哲学基本问题*(两个方面)的问答是?`,
            `第一方面: 物质与意志何者为第一性 \\
            谁是*(世界本原), *(先有谁) \\
            物质(存在):唯物主义 \\
            精神(意识):唯心主义 \\\\
            第二方面: 两者有关系吗, 意识能否反映物质 \\
            可知论、不可知论
            `,
        ],
    ]
} as ICardStack;
