import { ICardStack } from "../../types/card-type";

export default {
    id: "phl_basic",
    label: "哲学马原基础",

    cards: [
		[
			`马克思主义哲学(马哲)有哪几块内容?`,
			`唯物论、辩证法、认识论、唯物史观`,
		],

		[
			`什么是哲学基本问题?`,
			`哲学中*(最基本的)问题 \\ 研究哲学必须要研究的问题`,
			`哲学基本问题的两个方面`,
			`1. 物质和意识何者为第一性 \\
			 2. 物质和意识是否具有同一性
			`,
			`1. 物质和意识何者为第一性 \\ 这个问题将哲学家划分为?`,
			`唯物主义(物质具有第一性) \\ 唯心主义(意识具有第一性)`,

			`2. 物质和意识是否具有同一性 \\ 这个问题将哲学家划分为?`,
			`可知论(人的意识可以认识客观世界) \\ 不可知论(人的意识不可以认识客观世界)`,

			`唯物、唯心都为可知论者 \\ 二元论为不可知论 \\ 二元论是*(不彻底)的唯心主义者`,
		],

		[
			`什么是意识的*(能动)作用?`,

			`
				1. 意识反映世界具有*(自觉性), 具有*(目的性)和*(计划性) \\
				2. 意识不仅反映事物的现象, 而且反映世界的本质和规律 \\
				3. 意识具有指导实践改造客观世界的作用 \\
				4. 意识还具有指导、控制人的行为和生理活动的作用
			`,
		],

		[
			`意识形成的过程中的*(影响因素)`,
			`
				在意识的产生和发展中 \\
				*(社会实践)特别是*(劳动)起*(决定性作用) \\
				*(语言)促进了意识的发展(*(重要因素)) \\
			`,
		],

		[
			`意识形成的阶段`,
			`
				*(从)一切物质所具有的反应特性(风吹摇动) \\
				*(发展到)=> \\
				1. 低等生物的刺激感应性(猪、狗条件反射) \\
				2. 高等动物的感觉和心理(猩猩) \\
				3. 人类的意识(意识人类独有) \\
			`,
		],
		[

			`*(意识)的定义`,
			`
				意识是物质世界长期发展的产物 \\
				是人脑的机能和属性 \\
				*(是物质世界的主观映象)(最重要)
			`,
		],
		[
			`人类历史、生产力、生产关系属于*(物质范畴)吗?`,
			`人类历史、生产力、生产关系*(都属于)物质范畴`,
		],
		[
			`物质的定义`,

			`物质是标志客观实在的哲学范畴 \\\\
			这种感觉是*(人通过感觉感知的) \\ 它不依赖于我们的感觉而存在 \\
			为我们的感觉所复写、摄影、反映`
		],

    ]
} as ICardStack;
