import { ICardStack } from "../../types/card-type";

export default {
    id: "phl_basic",
    label: "哲学马原基础",

    cards: [
        // [
        //     ``,
        //     ``,
        // ],

        [
            `人与*(规律)的关系?`,
            `人不能创造、改变、消灭规律 \\
            但可以发现、认识利用规律 \\\\
            自然规律:与人无关 \\
            历史规律:与人有关`,
        ],


        [
            `什么叫*(发挥主观能动性?)`,
            `通过*(实践),把*(想法)变成*(现实)`,
        ],

        [
            `新事物、旧事物的区别?`,
            `新事物: 合乎历史前进方向、具有远大前途的东西 \\
            旧事物:  丧失历史必然性、日趋灭亡的东西 \\\\
            根本区别: 同历史前进方向是否符合
            `,
        ],

        [
            `联系的特点`,
            `联系具有: 客观性、普遍性、多样性、条件性`,
            `联系的*(客观性): \\\\
            事物之间的联系是*(本身所固有的) \\
            *(不以人的意志为转移)
            `,
            `联系的*(普遍性): \\\\
            *(任何事物内部)的不同部分和要素之间 \\
            都是相互联系的, *(具有内在的结构性 ) \\\\
            任何事物都不能孤立存在 \\
             都同其它事物处于一定的联系之中 \\\\
             整个世界是相互联系的*(统一整体)
            `,
            `联系的*(多样性): \\\\
            事物是多种多样的 \\ 其之间的*(联系)也是多样的
            `,
            `联系的*(条件性): \\\\
            有利条件促进事物发展 \\
            不利条件阻挠事物发展 \\\\
            条件是可以改变的 \\
            改变和创造条件*(不是任意的) \\ 
            要尊重事物发展的客观规律
            `,
        ],

        [
            `什么是*(联系)?`,
            `联系的定义: \\ \\
            (*(内部):) 事物内部各要素 (*(外部):) 和事物之间 \\
            相互影响、相互制约、相互作用的关系`,
        ],

        [
            `物质与意识的关系`,
            `物质决定意识 \\
            (意识是客观世界的主观映象) \\\\
            意识反作用与物质 \\
            (意识可以通过实践转化为物质) \\\\
            意识的内容是*(客观的), 形式是*(主观的)
            `,
        ],

        [
            `物质世界(客观世界)的分化?`,
            `*(实践)将物质世界(客观世界)分为: \\\\
            1. 自在自然(无人的自然界) \\
            2. 人化自然(人类社会)
            `,
        ],

        [
            `时空是无限的?绝对的?`,
            `*(对整个物质世界)来说:时空是无限的、绝对的 \\
            时空的*(客观实在性)是绝对的、无条件的 \\\\
            *(对具体的物质形态):时空是有限的、相对的 \\
            (比如: 人的时间是有限的, 终将老去) \\
            时空的*(具体特性)是相对的、有条件的
            `,
        ],

        [
            `静止与运动的关系?`,
            `静止是运动的*(衡量尺度) \\\\
            静止: 相对的、暂时的 \\
            运动: 绝对的、无条件的 \\
            `,
        ],

        [
            `物质的唯一特性是?`,
            `物质的唯一特性(共同特性/本质规定): \\ *(客观实在性)`,
        ],
        
        [
            `时间、空间的维度?`,

            `时间(一维性): *(一去不复反) \\
            空间(三维性) 
            `,
        ],

        [
            `运动的物质在哪里存在?`,
            `在时间和空间里存在 \\
            时间空间是*(运动着的物质)的基本存在形式
            `,
        ],

        [
            `物质的存在方式和根本属性是?`,
            `*(运动)是物质的存在方式和根本属性`,
        ],

        [
            `唯心主义的分类和特点?`,
            `唯心主义分为*(主观)和*(客观)唯心主义 \\\\
                1. 主观唯心: *(人的感觉)、以*(我)为出发点 \\
                2. 客观唯心: *(道、宇宙精神)、*(非我)、超自然的某种力量 \\
                `,
        ],

        [
            `什么是*(一元论)?`,
            `一元论: 世界的本原只有一个`,
        ],
        [
            `辩证唯物主义*(最基本、最核心)的观点是?`,
            `辩证唯物主义*(最基本、最核心)的观点是: \\\\
                *(世界的物质统一性原理)
                `,
        ],

        [
            `哲学重要问题`,
            `
                哲学重要问题: *(世界怎样存在?) \\\\

                1. *(辩证法): 世界是联系、发展的 \\
                发展的原因在于*(事物的内部矛盾) \\\\

                2. *(形而上学): 世界是孤立静止的 \\
                否认内部矛盾的存在和作用 \\\\
            `,
        ],
        [
            `哲学基本问题*(两个方面)的问答是?`,
            `第一方面: 物质与意志何者为第一性 \\
            谁是*(世界本原), *(先有谁) \\
            物质(存在):唯物主义 \\
            精神(意识):唯心主义 \\\\
            第二方面: 两者有关系吗, 意识能否反映物质 \\
            可知论、不可知论
            `,
        ],
    ]
} as ICardStack;
