import { ICardStack } from "../../types/card-type";

export default {
    id: "math-basic",
    label: "数学基础",

    cards: [
        // [``, ``],
        // [``, ``],
        // [``, ``],
        // [``, ``],
        // [``, ``],
        [`中值定理(严格定义)`, `如果f(x)在[a,b]上连续 \\ 对于f(a)与f(b)之间的任意一点M \\ 都至少有一个c\in(a,b) \\ 使得f(c)=M`],
        [`什么叫在[a,b]上连续？`, `1. 在(a, b)上每点都连续 \\ 2. 在a点上右连续 \\ 3. 在b点上左连续`],
        [`中值定理(直观理解) \\ f(x)在(a,b)上连续`,
            `因为在[a,b]上连续 \\ f(x)的图像从a点画到b点 \\ 那么对于f(a)与f(b)之间的任意w \\ f(x)的图像一定经过w \\ 也就是f(x)=M一定有解`,
            "image:test.svg",
        ],
        [`假设f与g都是连续函数 \\ f+g, f-g, f*g, \frac{f}{g} 是连续的吗？`, `+, -, *都为连续函数 \\ \frac{f}{g} 在其定义区间上连续(g\neq0)`],
        [`什么是连续函数`, `text:函数定义域内每个点都连续\n称该函数为连续的`],
        [`列出间断点的情况`, `text:第一类间断点: \n 可去间断点：该点极限存在，但极限值与函数值不同 \n 跳跃间断点：左右极限都存在，但两边不相等`,
            "text:第二类间断点: \n 不属于第一类的都归到第二类(如无穷、振荡间断点)"
        ],
        [`说点a在f(x)上是连续的 \\ 我们能得到什么?`, `a点极限值存在 \\ a点函数值存在 \\ 且极限值=函数值`],
        [`左、右连续性的定义`, `左连续：lim(a^-,L)=f(a) \\ 右连续：lim(a^+,L)=f(a)`],
        [`什么是连续性(直观理解)`, `对于一点来说: \\ 这点的函数值于其极限值是相同的。\\ 对于区间来说：\\ 从区间左边画到右边，笔不用抬起来`],

        [`极限的严格定义`, `\lim_{x\to a}f(x)=L的严格定义: \\ (\forall \epsilon>0) (\exists \delta>0) \\ (\forall x) (0<|x-a|<\delta) \Longrightarrow |f(x)-L|<\epsilon`],
        [
            `列举极限的运算法则 \\ \lim_{x\to a}f(x)=L \\ \lim_{x\to a}g(x)=M`,
            `\lim_{x\to a}f(x)+\lim_{x\to a}g(x)=L+M \\ \lim_{x\to a}f(x)-\lim_{x\to a}g(x)=L-M \\ \lim_{x\to a}f(x)*\lim_{x\to a}g(x)=L*M \\ \frac{\lim_{x\to a}f(x)}{\lim_{x\to a}g(x)}=\frac{L}{M} (M \neq 0)`
        ],
        [
            `text:请列举(左|右)极限不存在的情况`,
            `1. (左|右)极限会碰到无穷 \\ 如f(x)=\frac{1}{x} \\ 在x=0处的左、右极限就是无定义 \\ 记作 DNE`,
            `2. 函数在某点处可能疯狂振荡 \\ 此时也不存在左、右极限值 \\ 如f(x)=\sin(\frac{1}{x})`,
        ],
        [`极限存在的条件?`, `左、右极限存在且相等 \\ \lim_{x\to a^-}f(x)=L=\lim_{x\to a^+}f(x)`],
        [
            "text:极限的定义?(直观的理解)",
            `对于函数f(x)上的一点a来说 \\ x从a的左边逼近(逼近但不相等) \\ f(x)的值也随之逼近一个定值L的话 \\ 就称f(x)在a点的左极限是L \\ 记作: \lim_{x\to a^-} f(x)=L`,
            `同理，如果x从a的右边逼近(逼近但不相等) \\ f(x)的值也随之逼近一个定值L的话 \\ 就称f(x)在a点的右极限是L \\ 记作: \lim_{x\to a^+} f(x)=L`,
        ],

        // [`\\lim_{h \\to 0}{(1+xh)^{\\frac{1}{h}}}`, "e^x"],
        // ["\\lim_{n \\to \\infty}{(1+\\frac{1}{n})^{n}}", "e"],
        // ["\\lim_{h \\to 0}{(1+h)^{\\frac{1}{h}}}", "e"],
        // [`\frac{10}{4x} \approx 2^{12}`, "123"],
        // ["image:linear_a2_2.png", "Ans"],
    ]
} as ICardStack;