import { ICardStack } from "../../types/card-type";

export default {
    id: "diff_equation",
    label: "微分方程",

    cards: [
        [
            `什么是欧拉方程?`,
            `x^ny^{(n)}+p_1x^{n-1}y^{(n-1)}+\dotsb+p_{n-1}xy'+p_ny \\
            形如上式的方程称为*(欧拉方程), 其中p_1\dotsb p_n为常数 \\\\
            解法: 令x=e^t \\ 
            x^ky^{(k)}=D(D-1)\dotsb(D-k+1)y \\
            例如: x^2y''=D(D-1)y \:\:\:\: *(到D-2+1为止) \\
            其中Dy=\frac{dy}{dt}, D^2y=\frac{d^2y}{dt^2} \\\\

            这样欧拉方程就化成了*(线性常系数方程)\\
            求解即可!*(最后别忘了把t再换回x)
            `,

            `解题技巧: \\
            x^ky^{(k)}=D(D-1)\dotsb(D-k+1)y \\
            这里不需要把Dy写成对t的导数 \\
            直接把D写成r, 直接写出*(特征方程)即可 \\\\
            如,把x^ky^{(k)}代入微分方程后: \\
            (D^2-D)y+4Dy+2y=0 \\
            把y舍去, D变成r \\
            r^2-r+4r+2=0
            `,
        ],
        [
            `常系数*(非齐次)微分方程解法?`,
            `y''+py'+qy=f(x) \\
            首先求齐次方程的通解 \\\\
            接着求非齐次的特解: (下一页)
            `,
            `
            若f(x)=P_m(x)e^{\lambda x} \:\:\:\: (其中P_m(x)代表m次多项式) \\\\
            设非齐次特解: y^*=x^kQ_m(x)e^{\lambda x} \\\\
            其中Q_m(x)为m次多项式,系数待定 \\
            如P_m(x)=x^2, Q_m(x)=ax^2+bx+c \\\\

            x^k中的k代表特征方程含\lambda的重复次数 \\
            如特征方程里两个实根都=\lambda, k就取2 \\
            要是特征方程的根里没有\lambda,k就取0 \\\\
            最后:把y^*代入非齐次方程中,把系数定下来即可
            `,

            `
            若f(x)=e^{$a x}[P_l^{(1)}(x)\cos $b x+P_n^{(2)}(x)\sin $b x] \\
            其中P_l^{(1)}(x)代表l次多项式, ^{(1)}做标识用,非导数符号 \\\\

            设非齐次特解: y^*=x^ke^{$a x}[R_m^{(1)}(x)\cos $b x+R_m^{(2)}(x)\sin $b x] \\\\

            m=\max \{l,n\} \\
            f(x)中次数可以不同, 特解中都为m次多项式 \\ \\

            当$a+i$b*(不是)特征方程的根时: k=0 \\
            当$a+i$b*(是)特征方程的根时: k=1 \\\\

            最后:把y^*代入非齐次方程中,把系数定下来即可
            `,
        ],
        [
            `常系数齐次微分方程解法?`,
            `y''+py'+qy=0 \\
            *(特征方程): r^2+pr+q=0 \\
            若r_1, r_2为特征方程的两个根 \\\\
            若r_1\neq r_2, 不相等的两个实根 \\
            通解: y=C_1e^{r_1x}+C_2e^{r_2x} \\\\

            若r_1=r_2, 相等的两个实根 \\
            通解: y=(C_1+C_2x)e^{r_1x} \\\\

            若r_1=$a+i$b, r_2=$a-i$b, 一对共轭复根 \\
            通解: y=e^{$a x}(C_1\cos $b x+C_2 \sin $b x)
            `,
        ],
        [
            `说y_1(x)和y_2(x)是齐次方程的两个特解 \\
            如何判断y_1(x)和y_2(x)是否线性无关?
            `,
            `y_1(x)和y_2(x)线性无关: \\\\
            \frac{y_1(x)}{y_2(x)} \not\equiv C \\\\
            *(两函数之比不恒等于常数)
            `,
        ],
        [
            `非齐次方程特解与齐次方程的关系`,
            `若y^*_1(x)与y^*_2(x)是非齐次方程的两个特解 \\
            y(x)=y^*_2(x)-y^*_1(x)是齐次方程的解 \\
            (应该是特解? 书上没写清楚)
            `,
        ],
        [
            `y''+p(x)y'+q(x)y=f(x)+g(x) \\
            非齐次右边是两个*(函数和的),该怎么解?`,
            `y''+p(x)y'+q(x)y=f(x) \\
            若y^*_1(x)是\dotsb =f(x)的一个特解 \\\\
            
            y''+p(x)y'+q(x)y=g(x) \\
            若y^*_2(x)是\dotsb =g(x)的一个特解 \\\\ 
            y^*_1(x)+y^*_2(x)是\dotsb=f(x)+g(x)的一个特解 \\
            *(非齐次右边可以拆开做)
            `,
        ],
        [
            `非齐次方程通解形式`,
            `
                y''+p(x)y'+q(x)y=f(x) \\
                若y^* (x)是非齐次方程的一个特解 \\\\

                y''+p(x)y'+q(x)y=0 \\
                若y_1(x)和y_2(x)是齐次方程的两个*(线性无关)特解 \\\\

                非齐次方程的*(通解为) \\ y=y^* (x)+C_1y_1(x)+C_2y_2(x)
            `,
        ],
        [
            `齐次方程通解、特解的关系`,
            `
                y''+p(x)y'+q(x)y=0 \\\\
                若y_1(x)和y_2(x)是齐次方程的两个*(线性无关)特解 \\
                通解为: y=C_1y_1(x)+C_2y_2(x)
            `,
        ],
        [
            `什么是二阶线性方程`,
            `y''+p(x)y'+q(x)y=0 \\

            二阶线性方程: \\
            微分方程的阶数=2 (*(二阶))\\
            y'', y', y 中次数=1 (*(线性)) \\\\
            `,
            `
            y''+p(x)y'+q(x)y=0 \\
            左边是未知数,右边是零 (*(齐次))
            `,
            `
            y''+p(x)y'+q(x)y=f(x) \\
            左边是未知数,右边不是零 (*(非齐次))
            `,
        ],
        [
            `如何解形如 y''=f(y,y')的微分方程?`,
            `y''=f(y,y') \\
            令y'=P, y''=\frac{dy}{dP}P
            `,
        ],
        [
            `如何解形如 y''=f(x,y')的微分方程?`,
            `y''=f(x,y') (不显含y,可降阶) \\
            令y'=P, y''=\frac{dP}{dx} \\ 可以把原方程化成可分离变量方程`,
        ],
        [
            `全微分方程 \\ du(x,y)=P(x,y)dx+Q(x,y)dy`,
            `后续再看`,
        ],
        [
            `如何解形如y'+p(x)y=Q(x)y^n的微分方程? \\\\
            (n\neq 0,1) \\
            若n=0, 则该方程是个一阶线性微分方程 \\
            若n=1, 则该方程是个可分离变量方程
            `,
            `y'+p(x)y=Q(x)y^n \\
            两边同除y^n, 会出现y^{1-n} \\ \\
            令u=y^{1-n}, 既可将原式化为一阶线性方程`,
        ],
        [
            `如何解形如y'+p(x)y=q(x)的微分方程`,
            `image:1jie_eq.png(
                一阶线性微分方程: y'+p(x)y=q(x) \\
                y'和y都是一次的 \\
                写成*(标准形式),代通解 \\
                通解公式中的不定积分*(不用加常数) \\
                若p(x)积分中出现inv(x),直接写\ln x,*(不用绝对值)
            )`,
        ],
        [
            `如何解形如\frac{dy}{dx}=$phi(\frac{y}{x})的微分方程`,
            `齐次微分方程: \frac{dy}{dx}=$phi(\frac{y}{x}) \\
            令u=\frac{y}{x}, y'=u+xu' \\\\
            这样就把原式化成了*(可分离变量方程)
            `
        ],
        [
            `如何解形如g(y)dy=f(x)dx的微分方程`,
            `可分离变量方程: g(y)dy=f(x)dx \\
            两边求积分即可:  \\\\
            
            \int g(y)dy=\int f(x)dx`,
        ],
        [
            `什么是微分方程的阶`,
            `微分方程的阶: \\ 未知函数的最高阶导数*(的阶数)`,
        ],
        [
            `什么是微分方程的解`,
            `满足微分方程的函数，称为该方程的解.`,
        ],
        [
            `什么是微分方程的*(通解)`,

            `微分方程的*(通解): \\\\
            微分方程的解中含有*(任意常数) \\
            任意常数的个数与微分方程的*(阶数相同)`,
        ],
        [
            `什么是微分方程的*(特解)`,
            `微分方程的*(特解): \\
            不含任意常数的解
            `,
        ],
        [
            `什么是微分方程?`,
            `微分方程: \\ 含有未知函数的导数或微分的方程`,
        ],

        [
            `什么是微分方程的*(初始条件)`,
            `是微分方程的*(初始条件): \\ 确定特解和一组常数的条件`,
        ],

        [
            `什么是微分方程的*(积分曲线)`,
            `微分方程的*(积分曲线): \\ 方程的一个解在平面上对应*(一条曲线) \\
             称该曲线为该微分方程的积分曲线`,
        ],
    ]
} as ICardStack;
