import { ICardStack } from "../../types/card-type";

export default {
    id: "linear_tric",
    label: "线代解题技巧",

    cards: [
        [
            `image:linear_refactor_1.png(如何巧算?)`,
            `image:linear_refactor_1.png(
                看到题中给出关系式的,要想能不能做变换 \\
                AB+2A=A(B+2E) \\
                可以看出B+2E是满秩的,只要判断A的秩就可以了 \\
                A的秩就是答案
            )`,
        ],
        [
            `image:vander.png(范德蒙德行列式=?)`,
            `image:vander_ans.png(
                假设第二行是|A \:\: B \:\: C| \\
                范德蒙德行列式=(C-B)(C-A)(B-A)
            )`,
            // https://www.youtube.com/watch?v=0T4mV5rQPxs
        ],
        [
            `向量组a_1,a_2,\dotsb,a_q可由向量组$b_1,$b_2,\dotsb,$b_p线性表示 \\\\
            这句话是什么意思?
            `,
            `向量组a_1,a_2,\dotsb,a_q 中的*(每一个向量) \\
            都可由向量组$b_1,$b_2,\dotsb,$b_p线性表示 `,
        ],
        [
            `a_1,a_2,a_3线性无关, $b_1可由a_{1..3}线性表示 \\
            $b_2不能由a_{1..3}线性表示 \\\\

            a_1,a_2,a_3,$b_1+$b_2是线性相关的吗
            `,
            `a_1,a_2,a_3,$b_1+$b_2 \\
            因为$b_1可以由a_{1..3}线性表示 \\
            令矩阵A=[a_1,a_2,a_3,$b_1+$b_2] \\
            对矩阵A做列变换,把$b_1消掉 \\
            得到A=[a_1,a_2,a_3,$b_2], r(A)=4 \\\\
            *(线性无关)`,
        ],
        [
            `已知a_1, a_2线性无关, a_1,a_2,a_3相性相关 \\\\
            为什么a_3一定能被a_1, a_2线性表示?
            `,
            `
            证明一： \\\\
            想象a_1, a_2的图像 \\
            a_1,a_2线性无关, 两者的线性组合构成一个*(平面) \\
            a_1,a_2,a_3线性相关, 秩为2 \\ 三者线性组合*(也是一个平面) \\
            a_3一定在a_1, a_2的平面上
            `,

            `证明二: \\\\
            a_1,a_2线性无关 \\ c_1a_1+c_2a_2=0 \:\:\:\: (其中c_1,c_2必为0) \\ \\
            a_1,a_2,a_3线性相关 \\ c_1a_1+c_2a_2+c_3a_3=0 \\ 
            其中c_3\neq0, 否则c_1,c_2也是0, *(就和线性相关矛盾) \\
            -c_3a_3=c_1a_1+c_2a_2 \\ \\
            a_3=-\frac{c_1}{c_3}a_1-\frac{c_2}{c_3}a_2
            `,
        ],
        [
            `image:same_sum.png`,
            `image:det_1.png(
                主对角相同、其余元素相同 \\
                D_n=[a+(n-1)b](a-b)^{n-1}
            )`,
            `image:det_1.png(
                把所有列加到第一列上 \\
                把第一列上的a+(n-1)b提出来 \\ 
                第一列就都是1, 让每一行减去第一行 \\
                对角线上就剩下(a-b), 一个有n-1个 \\
                D_n=[a+(n-1)b](a-b)^{n-1}
            )`,
        ],

        [
            `image:zhua.png`,
            `image:zhua.png(
                爪型矩阵求行列式 \\
                消元成上三角矩阵
            )`,
        ],
    ]
} as ICardStack;
