import { ICardStack } from "../../types/card-type";

export default {
    id: "math_trick",
    label: "做题技巧",

    cards: [
        [
            `已知y=e^{-x}, y=2xe^{-x},y=3e^x \\
            是3阶微分方程的3个特解 \\\\
            求出特征根`,

            `y=e^{-x}, y=2xe^{-x},y=3e^x  \\
            观察y=e^{-x}可知-1是一个特征根 \\\\
            观察y=2xe^{-x}可知-1是二重根 \\
            二重根: (C_1+C_2x)e^{kx}形式 \\\\
            观察y=3e^x 可知1是一个特征根 \\
            所以特征根是: -1,-1,1 \\
            特征方程: (r+1)^2(r-1)=0
            `,
        ],
        [
            `二阶*(常系数)微分方程 \\ 微分算子法 \\
            什么是D, inv(D)
            `,
            `D代表求导, inv(D)代表积分 \\\\
            如Dx=1, Dx^2=2x \\ (D+1)x=Dx+x \\\\
            inv(D)x=inv(2)x^2
            `,

            `第一类: y''+ay'+by=e^{kx} \\
            如何用微分算子法求特解?`,
            `第一类: y''+ay'+by=e^{kx}  \\
            y^*=\frac{1}{f(D)}e^{kx}, 其中f是特征方程 \\\\
            例: 对y''+3y'-2y=e^{2x}来说 \\
            f(D)=D^2+3D-2 \\\\
            把k代入到D,若分母\neq 0, 特解就求出来了 \\
            若分母=0, y^*=\frac{1}{f(D)}e^{kx}=x \frac{1}{f'(D)}e^{kx} \\
            提个x出来, 对f(D)求导 \\\\

            若分母还=0, 则继续提x,对f(D)求导
            `,

            `第二类: y''+ay'+by=\sin ax或\cos ax \\
                y^*=\frac{1}{f(D)}f(x) \\
                把a代入D^2,*(注意!),只能代D^2 \\
                把D^2换成-a^2 \\
                这里其实是把D换成了ai(D^2=(ai)^2=-a^2) \\ \\

                如果分母变成常数, 特解y^*就找到了 \\
                若分母还有D, 平凡差等价代换: \\
                例: inv(D+1)=\frac{D-1}{D^2-1} \\
                这样就可以把*(分母消掉), 分子就是求导(简单)
            `,
            `第三类: f(x)=e^{kx}$phi(x) \\
            y^*=\frac{1}{f(D)}e^{kx}$phi(x) \\
            把e^{kx}*(提出去),D变成D+k \\
            y^*=\frac{1}{f(D)}e^{kx}$phi(x)=e^{kx}\frac{1}{f(D+k)}$phi(x) \\\\
            然后正常算就好了
            `
        ],
        [
            `y''+p(x)y'+q(x)y=0 \\
            对于*(二阶齐次微分方程)的两个解: y_1和y_2 \\\\
            两个解满足什么关系?
            `,
            `y_1'y_2-y_1y_2'=Ae^{-\int p(x)dx } \\
            其中A为某个常数, 非任意常数
            `,

            `证明, 已知: \\
                y_1''+p(x)y_1'+q(x)y_1=0 \\
                y_2''+p(x)y_2'+q(x)y_2=0 \\\\

                两个等式分别乘上y_2和y_1, 相减后把q(x)消掉: \\
                (y''_1y_2-y_1y''_2)+p(x)(y_1'y_2-y_1y_2')=0 \\ \\
                其中可以凑出y_1'y_2-y_1y_2'的导数: \\
                (y_1'y_2-y_1y_2')'+p(x)(y_1'y_2-y_1y_2')=0 \\
                这样就化成了*(一阶微分方程),用公式即可得到: \\\\
                y_1'y_2-y_1y_2'=Ae^{-\int p(x)dx }
            `,
        ],
        [
            `已知y^*=e^{-2x}+(x^2+2)e^x是 \\
            二阶常系数*(非齐次)微分方程的一个解 \\\\
            找出*(齐次特征根)`,
            `y^*=e^{-2x}+(x^2+2)e^x \\\\
            我们知道*(非齐次通解)的形式是y=Cy_1+Cy_2+y^* \\
            但是,题中的y^*和通解里的y^* *(不一样!!!) \\
            题中的y^*是非齐次通解*(定常数)得到的特解 \\
            所以下面把y^*写成y \\\\

            y=e^{-2x}+x^2e^x+2e^x  \\
            其中 x^2e^x一定是*(非齐次通解)里的y^* (因为前面的x^2) \\
            所以*(齐次特征根)分别是-2和1
            `,
        ],
        [
            `判断\int_0^\pi \frac{\sin^22t}{1+\cos^2t}dt的正负`,
            `\int_0^\pi \frac{\sin^22t}{1+\cos^2t}dt \\\\
            令f(x)=\frac{\sin^22t}{1+\cos^2t} \:\:\:\: 在0到\pi上: f(x)\ge 0 \\\\
            且f(x)不恒为0, 所以其积分一定大于零
            `,
        ],
        [
            `已知连续函数f(x)满足: \\
            f(x)=\int_0^{3x} f\left (\frac{t}{3} \right )dt+e^{2x} \\\\
            问:f(x)*(是否可导)?
            `,
            `
            已知f(x)是*(连续函数) \\
            其变上限积分一定可导
             \\\\
            f(x)=\int_0^{3x} f\left (\frac{t}{3} \right )dt+e^{2x} \\\\
            等式右边*(可导+可导), f(x)一定可导
            `,
        ],
        [
            `设y=y(x)是二阶常系数微分方程 \\
            y''+py'+qy=e^{3x} \\
            满足初始条件y(0)=y'(0)=0的特解 \\\\
            可以得到y(x)的什么信息?
            `,
            `设y=y(x)是二阶常系数微分方程 \\
            *(所以y是二阶可导)  \\\\

            y''+py'+qy=e^{3x} \\
            二阶可导, *(所以y, y'都连续) \\
            y',y,e^{3x}都连续, 所以y''也连续
            `,
        ],

        [
            `什么是等价向量组?`,
            `(I): $a_1, $a_2,\dotsb $a_n \\
            (II): $b_1, $b_2,\dotsb $b_m \\ 
            若(I)中的所有向量都可由(II)线性表示 \\
            称(I)可以由(II)线性表示 \\\\
            若(I)和(II)可以互相线性表示 \\
            称(I)与(II)等价
            `,
        ],
        [
            `image:linear_refactor_1.png(如何巧算?)`,
            `image:linear_refactor_1.png(
                看到题中给出关系式的,要想能不能做变换 \\
                AB+2A=A(B+2E) \\
                可以看出B+2E是满秩的,只要判断A的秩就可以了 \\
                A的秩就是答案
            )`,
        ],
        [
            `image:vander.png(范德蒙德行列式=?)`,
            `image:vander_ans.png(
                假设第二行是|A \:\: B \:\: C| \\
                范德蒙德行列式=(C-B)(C-A)(B-A)
            )`,
            // https://www.youtube.com/watch?v=0T4mV5rQPxs
        ],
        [
            `向量组a_1,a_2,\dotsb,a_q可由向量组$b_1,$b_2,\dotsb,$b_p线性表示 \\\\
            这句话是什么意思?
            `,
            `向量组a_1,a_2,\dotsb,a_q 中的*(每一个向量) \\
            都可由向量组$b_1,$b_2,\dotsb,$b_p线性表示 `,
        ],
        [
            `a_1,a_2,a_3线性无关, $b_1可由a_{1..3}线性表示 \\
            $b_2不能由a_{1..3}线性表示 \\\\

            a_1,a_2,a_3,$b_1+$b_2是线性相关的吗
            `,
            `a_1,a_2,a_3,$b_1+$b_2 \\
            因为$b_1可以由a_{1..3}线性表示 \\
            令矩阵A=[a_1,a_2,a_3,$b_1+$b_2] \\
            对矩阵A做列变换,把$b_1消掉 \\
            得到A=[a_1,a_2,a_3,$b_2], r(A)=4 \\\\
            *(线性无关)`,
        ],
        [
            `已知a_1, a_2线性无关, a_1,a_2,a_3相性相关 \\\\
            为什么a_3一定能被a_1, a_2线性表示?
            `,
            `
            证明一： \\\\
            想象a_1, a_2的图像 \\
            a_1,a_2线性无关, 两者的线性组合构成一个*(平面) \\
            a_1,a_2,a_3线性相关, 秩为2 \\ 三者线性组合*(也是一个平面) \\
            a_3一定在a_1, a_2的平面上
            `,

            `证明二: \\\\
            a_1,a_2线性无关 \\ c_1a_1+c_2a_2=0 \:\:\:\: (其中c_1,c_2必为0) \\ \\
            a_1,a_2,a_3线性相关 \\ c_1a_1+c_2a_2+c_3a_3=0 \\ 
            其中c_3\neq0, 否则c_1,c_2也是0, *(就和线性相关矛盾) \\
            -c_3a_3=c_1a_1+c_2a_2 \\ \\
            a_3=-\frac{c_1}{c_3}a_1-\frac{c_2}{c_3}a_2
            `,
        ],
        [
            `image:same_sum.png`,
            `image:det_1.png(
                主对角相同、其余元素相同 \\
                D_n=[a+(n-1)b](a-b)^{n-1}
            )`,
            `image:det_1.png(
                把所有列加到第一列上 \\
                把第一列上的a+(n-1)b提出来 \\ 
                第一列就都是1, 让每一行减去第一行 \\
                对角线上就剩下(a-b), 一个有n-1个 \\
                D_n=[a+(n-1)b](a-b)^{n-1}
            )`,
        ],

        [
            `image:zhua.png`,
            `image:zhua.png(
                爪型矩阵求行列式 \\
                消元成上三角矩阵
            )`,
        ],
    ]
} as ICardStack;
